const horoscopes = {
    dima: [
        "Сьогодні ви відчуєте енергію та мотивацію для нових звершень. Це чудовий день для початку нового проекту.",
        "Ви зможете досягти успіху, якщо будете наполегливо працювати.",
        "Цей день подарує вам багато можливостей для творчого самовираження."
    ],
    sasha: [
        "Час зосередитись на фінансових питаннях. Можливо, вам надійдуть цікаві пропозиції або несподіваний прибуток.",
        "Фінансові питання будуть вирішуватися успішно, якщо ви будете обережними.",
        "Вам краще зосередитись на роботі та кар'єрі. Ваші зусилля можуть дати значні результати, якщо ви будете наполегливими. Не бійтеся брати на себе відповідальність"
    ],
    matviy: [
        "Сьогодні важливо бути уважними до деталей. Ви можете знайти важливу Інформацію, яка допоможе вирішити поточні проблеми. Слідкуйте за своїм здоровям.",
        "Можливо, настав час відверто поговорити з близькими та розв'язати давні непорозуміння",
        "Можливо буде нагода знайти нові джерела доходу або оптимізувати витрати"
    ],
    roma: [
        "Ви можете отримати неочікувані новини, які вплинуть на ваші плани. Постарайтеся бути гнучкими й адаптуватися до нових обставин. Зберігайте спокій.",
        "Емоційний фон може бути нестабільним, тому намагайтеся уникати конфліктів. Займіться чимось що приносить вам задоволення, щоб відволіктися від стресу.",
        " Це сприятливий день для планування та організаці. Ви зможете впорядкувати справи що довгий час відкладали, і підготуватися до майбутніх викликів"
    ],
    danya: [
        "Цей день може принести вам можливість в лення старих проблем. Будьте уважні до знаків долі коли з'явиться шанс",
        "Легке серце допоможе вам пройти через усі складні часи.",
        "Бажаєте швидко знайти втрачену річ? Купи нову."
    ],
    andriy: [
        " Будьте уважні до своїх почуттів і постарайтеся не піддаватися імпульсивним рішенням. Цей день краще присвятити особистим стосункам і турботі про близьких.",
        "Помилки не робить тільки той, хто не пробує.",
        "Перемога – це коли ти стаєш краще, ніж був."
    ],
    zahar: [
        "Сьогодні вам варто приділяти увагу сімейним справам. Можливо, з'являться нові ідеї щодо облаштування будинку або покращення стосунків з близькими.",
        "це гарний день для нових знайомств і спілкування. ви можете знайти підтримку там, де не очікували. будьте відкриті до нових можливостей.",
        "Використайте ваш час для виконання важливих завдань і не бійтеся ризикувати."
    ],
    katia: [
        "Дозвольте собі відпочити і відновити сили. Це час для самоаналізу і планування майбутніх дій.",
        " Будьте відкритими до нових знайомств та спілкування, це може принести користь",
        "Сьогодні вам варто приділити увагу друзям і соціальним зв'язкам. Ваша допомога може бути комусь необхідною, ви самі знайдете підтримку."
    ],
    volodimir: [
        " Незалежно від твоїх вчинків життя влаштовує все так, як має бути.",
        "Після темряви обов'язково приходить світанок.",
        "Запитай себе, що зі зробленого сьогодні наблизить тебе до того, ким хочеш стати завтра"
    ],
    oksana: [
        "День може бути насичений внутрішніми переживаннями, але це дасть можливість глибше зрозуміти себе.",
        " Гарна презентація – це 80% успіху",
        "Визначся з кінцевою метою — і у тебе з'явиться шанс на перемогу."
    ],
    
};

function showHoroscope() {
    const zodiacSign = document.getElementById('zodiac-sign').value;

    if (zodiacSign) {
        const signName = document.getElementById('zodiac-sign').options[document.getElementById('zodiac-sign').selectedIndex].text;
        const horoscopeArray = horoscopes[zodiacSign];
        const randomIndex = Math.floor(Math.random() * horoscopeArray.length); 
        const horoscopeText = horoscopeArray[randomIndex]; 


        document.getElementById('sign-name').textContent = signName;
        document.getElementById('horoscope-text').textContent = horoscopeText;
        
        document.getElementById('zodiac-selector').classList.add('hidden');
        document.getElementById('horoscope-result').classList.remove('hidden');
    } else {
        alert("Будь ласка, оберіть свій знак зодіаку.");
    }
}

function resetPage() {
    document.getElementById('zodiac-sign').value = "";
    document.getElementById('horoscope-result').classList.add('hidden');
    document.getElementById('zodiac-selector').classList.remove('hidden');
}
